{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"activation": "linear", "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "name": "conv2d_1", "data_format": "channels_last", "batch_input_shape": [null, 48, 48, 1], "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "dtype": "float32", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "name": "batch_normalization_1", "trainable": true, "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_2", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "name": "batch_normalization_2", "trainable": true, "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.6}}, {"class_name": "Conv2D", "config": {"activation": "linear", "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_3", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "name": "batch_normalization_3", "trainable": true, "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_4", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "name": "batch_normalization_4", "trainable": true, "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_5", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "name": "batch_normalization_5", "trainable": true, "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.6}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_1", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "name": "batch_normalization_6", "trainable": true, "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.6}}, {"class_name": "Dense", "config": {"activation": "linear", "units": 7, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_2", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "softmax", "trainable": true}}]}